app/services/create_answer.rb

	def answer_lines(answers)
		answers.map do |answer|
			input_field = InputField::Base.find_by_slug(answer.first)
---
SELECT "input_fields".* FROM "input_fields" WHERE "input_fields"."slug" = ? LIMIT ?  [["slug", "que_savez_vous"], ["LIMIT", 1]]