app/views/home/index.html.erb


<% Form.all.each do |form| %>
---
SELECT "forms".* FROM "forms"