app/views/form_pages/show.html.erb


			<% @my_form.input_fields.each do |input_field|  %>
---
SELECT "input_fields".* FROM "input_fields" WHERE "input_fields"."form_id" = ?  [["form_id", 2]]