app/controllers/answers_controller.rb

SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def ensure_form
    @my_form = Form.find(params[:form_id])