app/controllers/forms_controller.rb

SELECT "forms".* FROM "forms"
---
  def index
    @my_forms = Form.all

INSERT INTO "forms" ("user_id", "title", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", nil], ["active", 1], ["created_at", "2022-12-29 15:21:27.901079"], ["updated_at", "2022-12-29 15:21:27.901079"]]
---
  def create
    @my_form = Form.new(form_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @my_form.save

UPDATE "forms" SET "title" = ?, "updated_at" = ? WHERE "forms"."id" = ?  [["title", "Qui va la ? "], ["updated_at", "2022-12-30 13:57:24.280023"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @my_form.update(form_params)

SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_form
      @my_form = Form.find(params[:id])