app/controllers/form_pages_controller.rb

INSERT INTO "answers" ("form_id", "data", "deleted", "deleted_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @answer = CreateAnswer.new.call(form_id: my_form.id, answers: answer_params.to_unsafe_h)

    respond_to do |format|
      if @answer.save

SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def my_form
    @my_form ||= Form.includes(input_fields: :options).find(params[:id])