app/controllers/input_fields_controller.rb

SELECT "input_fields".* FROM "input_fields" WHERE "input_fields"."form_id" = ?  [["form_id", 2]]
---
  def index
    @input_fields = InputField::Base.where(form_id: params[:form_id])

INSERT INTO "input_fields" ("type", "form_id", "data", "created_at", "updated_at", "hint", "required", "label", "position", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @input_field = InputField::Base.new(input_field_params.merge(form_id: @my_form.id))

    respond_to do |format|
      if @input_field.save

SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def ensure_form
    @my_form = Form.find(params[:form_id])

SELECT "input_fields".* FROM "input_fields" WHERE "input_fields"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_input_field
    @input_field = InputField::Base.find(params[:id])